test/http_recordings/charge_uncaptured.json

[
  {
    "request": {
      "body": "{\"transfer\":null,\"total_fees\":null,\"settlement_currency\":null,\"refund_pending\":null,\"metadata\":null,\"merchant_entitlement\":null,\"ip_address\":\"127.0.0.1\",\"email\":\"hagrid@hogwarts.wiz\",\"description\":\"Dragon eggs\",\"customer_token\":null,\"currency\":null,\"card_token\":null,\"card\":{\"number\":\"5520000000000000\",\"name\":\"Rubius Hagrid\",\"expiry_year\":\"20\",\"expiry_month\":\"12\",\"cvc\":\"321\",\"address_state\":null,\"address_postcode\":null,\"address_line2\":null,\"address_line1\":\"The Game Keepers Cottage\",\"address_country\":\"England\",\"address_city\":\"Hogwarts\"},\"captured\":null,\"capture\":false,\"authorisation_expired\":null,\"amount_refunded\":null,\"amount\":50000}",
      "headers": {
        "Authorization": "***",
        "Content-Type": "application/json"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://test-api.pin.net.au/1/charges"
    },
    "response": {
      "binary": false,
      "body": "{\"response\":{\"token\":\"ch_ZGTqpyHJPHSrLyrJ27CcYw\",\"success\":true,\"amount\":50000,\"currency\":\"AUD\",\"description\":\"Dragon eggs\",\"email\":\"hagrid@hogwarts.wiz\",\"ip_address\":\"127.0.0.1\",\"created_at\":\"2018-05-21T08:07:47Z\",\"status_message\":\"Successful Authorisation\",\"error_message\":null,\"card\":{\"token\":\"card_vJiKZQZdECZutoOtEVV3YQ\",\"scheme\":\"master\",\"display_number\":\"XXXX-XXXX-XXXX-0000\",\"expiry_month\":12,\"expiry_year\":2020,\"name\":\"Rubius Hagrid\",\"address_line1\":\"The Game Keepers Cottage\",\"address_line2\":null,\"address_city\":\"Hogwarts\",\"address_postcode\":null,\"address_state\":null,\"address_country\":\"England\",\"customer_token\":null,\"primary\":null},\"transfer\":[],\"amount_refunded\":0,\"total_fees\":null,\"merchant_entitlement\":null,\"refund_pending\":false,\"authorisation_expired\":false,\"captured\":false,\"settlement_currency\":\"AUD\",\"metadata\":{}}}",
      "headers": {
        "Date": "Mon, 21 May 2018 08:07:48 GMT",
        "Content-Type": "application/json; charset=utf-8",
        "Content-Length": "837",
        "Connection": "keep-alive",
        "Server": "nginx",
        "ETag": "W/\"e29a46539a2ce5ed08549ef63577f34c\"",
        "Cache-Control": "max-age=0, private, must-revalidate",
        "X-Request-Id": "7a922e8f-f7b7-420b-afb7-58fd72f9ffe4",
        "X-Runtime": "0.168744",
        "Strict-Transport-Security": "max-age=252460800; includeSubdomains; preload",
        "X-Content-Type-Options": "nosniff",
        "X-Download-Options": "noopen",
        "X-Frame-Options": "DENY",
        "X-Permitted-Cross-Domain-Policies": "none",
        "X-XSS-Protection": "1; mode=block"
      },
      "status_code": 201,
      "type": "ok"
    }
  }
]