test/http_recordings/charge_with_used_card_token.json

[
  {
    "request": {
      "body": "{\"transfer\":null,\"total_fees\":null,\"settlement_currency\":null,\"refund_pending\":null,\"metadata\":null,\"merchant_entitlement\":null,\"ip_address\":\"127.0.0.1\",\"email\":\"hagrid@hogwarts.wiz\",\"description\":\"Dragon eggs\",\"customer_token\":null,\"currency\":null,\"card_token\":\"card_R6khtY81EZE5RiqkidVhgA\",\"card\":null,\"captured\":null,\"capture\":null,\"authorisation_expired\":null,\"amount_refunded\":null,\"amount\":50000}",
      "headers": {
        "Authorization": "***",
        "Content-Type": "application/json"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://test-api.pin.net.au/1/charges"
    },
    "response": {
      "binary": false,
      "body": "{\"error\":\"token_already_used\",\"error_description\":\"Token already used. Card tokens can only be used once, to create a charge or assign a card to a customer\"}",
      "headers": {
        "Date": "Mon, 21 May 2018 08:21:54 GMT",
        "Content-Type": "application/json; charset=utf-8",
        "Content-Length": "157",
        "Connection": "keep-alive",
        "Server": "nginx",
        "Cache-Control": "no-cache",
        "X-Request-Id": "05cafaf5-52fe-4abc-84e5-5587a7ece671",
        "X-Runtime": "0.034717",
        "Strict-Transport-Security": "max-age=252460800; includeSubdomains; preload",
        "X-Content-Type-Options": "nosniff",
        "X-Download-Options": "noopen",
        "X-Frame-Options": "DENY",
        "X-Permitted-Cross-Domain-Policies": "none",
        "X-XSS-Protection": "1; mode=block"
      },
      "status_code": 400,
      "type": "ok"
    }
  }
]